# Pandas
ref: code with harry

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['harsh','hani','harshit'],
    "marks":[100,58,91],
    "city":['Rampur','kolkata','dholpur']
}

In [4]:
df = pd.DataFrame(dict1)
df

      name  marks     city
0    harsh    100   Rampur
1     hani     58  kolkata
2  harshit     91  dholpur

In [5]:
df.to_csv('Learning_pandas.csv')

In [6]:
df.to_csv('Learning_pandas_IndexFalse.csv', index = False)

In [7]:
df.head(2) #first two data
df.tail(2) #last two data

      name  marks     city
1     hani     58  kolkata
2  harshit     91  dholpur

In [8]:
df.describe()

            marks
count    3.000000
mean    83.000000
std     22.113344
min     58.000000
25%     74.500000
50%     91.000000
75%     95.500000
max    100.000000

In [9]:
data = pd.read_csv('Train_data.csv')
data

   Unnamed: 0  Train no  Speed     City
0           0     12322    100   Rampur
1           1     12534    123  kolkata
2           2    125654     67  dholpur
3           3    564523     87  gwalior

In [10]:
data['Speed']

0    100
1    123
2     67
3     87
Name: Speed, dtype: int64

In [11]:
data['Speed'][0]

100

In [12]:
data['Speed'][0]= 100
data

C:\Users\harsh\AppData\Local\Temp\ipykernel_30328\2189471887.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Speed'][0]= 100

   Unnamed: 0  Train no  Speed     City
0           0     12322    100   Rampur
1           1     12534    123  kolkata
2           2    125654     67  dholpur
3           3    564523     87  gwalior

In [13]:
data.to_csv('Train_data.csv')

In [14]:
data.index = ['first','second','third','fourth']
data

        Unnamed: 0  Train no  Speed     City
first            0     12322    100   Rampur
second           1     12534    123  kolkata
third            2    125654     67  dholpur
fourth           3    564523     87  gwalior

In [15]:
data.to_csv('Train_data.csv')

pandas has two type of data structures 
1. Series: 1D array
2. Dataframes: tabular spread sheet like data structure

In [18]:
ser = pd.Series(np.random.rand(34))
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))
newdf

            0         1         2         3         4
0    0.733352  0.574815  0.538166  0.116689  0.699887
1    0.080403  0.242076  0.643896  0.412260  0.790391
2    0.483287  0.878785  0.578462  0.099546  0.528282
3    0.432857  0.994903  0.638404  0.814692  0.176334
4    0.975439  0.395670  0.110242  0.627980  0.617755
..        ...       ...       ...       ...       ...
329  0.017893  0.795698  0.699419  0.921414  0.643540
330  0.090897  0.584191  0.874407  0.216312  0.529868
331  0.045063  0.611423  0.219544  0.669319  0.342805
332  0.976453  0.224766  0.087656  0.194315  0.074177
333  0.275267  0.402811  0.655725  0.714409  0.480700

[334 rows x 5 columns]

In [20]:
type(newdf)

pandas.core.frame.DataFrame

In [21]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.480068    0.498610    0.523062    0.493296    0.497099
std      0.289549    0.291519    0.286534    0.280273    0.285276
min      0.004593    0.005833    0.002713    0.001848    0.015047
25%      0.232689    0.244759    0.269059    0.257042    0.242569
50%      0.460512    0.493114    0.533729    0.467714    0.500282
75%      0.727533    0.755213    0.784611    0.734324    0.727029
max      0.996746    0.999428    0.997078    0.997752    0.989904

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf[0][0]= 'harsh'

C:\Users\harsh\AppData\Local\Temp\ipykernel_30328\687807849.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'harsh' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]= 'harsh'

In [24]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [26]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [28]:
newdf.to_numpy()

array([['harsh', 0.5748147773043275, 0.538166223898115,
        0.11668898175504716, 0.6998871928862739],
       [0.0804029706862206, 0.24207642306722377, 0.6438955787102314,
        0.4122599030300176, 0.7903908546552326],
       [0.48328749382786074, 0.8787851432789862, 0.5784621718485413,
        0.09954626773466257, 0.5282818145340306],
       ...,
       [0.04506305300067559, 0.6114229378127994, 0.21954395084577671,
        0.6693192648038008, 0.34280493983066507],
       [0.9764532630754699, 0.22476583561785723, 0.08765642736610613,
        0.19431533833336423, 0.07417677034112735],
       [0.27526711921905045, 0.4028110864681531, 0.6557253020962932,
        0.7144092691966278, 0.48069963424364004]], dtype=object)

In [30]:
newdf[0][0]= 0.111

In [31]:
newdf.head()

          0         1         2         3         4
0     0.111  0.574815  0.538166  0.116689  0.699887
1  0.080403  0.242076  0.643896  0.412260  0.790391
2  0.483287  0.878785  0.578462  0.099546  0.528282
3  0.432857  0.994903  0.638404  0.814692  0.176334
4  0.975439  0.395670  0.110242  0.627980  0.617755

### Transposing

In [32]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.111,0.080403,0.483287,0.432857,0.975439,0.391951,0.877127,0.04715,0.214523,0.023785,...,0.701285,0.20853,0.157154,0.080031,0.372745,0.017893,0.090897,0.045063,0.976453,0.275267
1,0.574815,0.242076,0.878785,0.994903,0.39567,0.814133,0.999428,0.472724,0.985837,0.553832,...,0.091088,0.783534,0.863422,0.802006,0.494876,0.795698,0.584191,0.611423,0.224766,0.402811
2,0.538166,0.643896,0.578462,0.638404,0.110242,0.563042,0.367639,0.360511,0.569916,0.599692,...,0.683672,0.672788,0.625621,0.216102,0.666392,0.699419,0.874407,0.219544,0.087656,0.655725
3,0.116689,0.41226,0.099546,0.814692,0.62798,0.198552,0.591836,0.771762,0.235033,0.660796,...,0.290242,0.398167,0.104158,0.640909,0.617797,0.921414,0.216312,0.669319,0.194315,0.714409
4,0.699887,0.790391,0.528282,0.176334,0.617755,0.630365,0.862357,0.864036,0.482442,0.064887,...,0.247681,0.93829,0.31517,0.379764,0.880987,0.64354,0.529868,0.342805,0.074177,0.4807

In [33]:
newdf.head()

          0         1         2         3         4
0     0.111  0.574815  0.538166  0.116689  0.699887
1  0.080403  0.242076  0.643896  0.412260  0.790391
2  0.483287  0.878785  0.578462  0.099546  0.528282
3  0.432857  0.994903  0.638404  0.814692  0.176334
4  0.975439  0.395670  0.110242  0.627980  0.617755

In [35]:
newdf.sort_index(axis=0,ascending=True)

            0         1         2         3         4
0       0.111  0.574815  0.538166  0.116689  0.699887
1    0.080403  0.242076  0.643896  0.412260  0.790391
2    0.483287  0.878785  0.578462  0.099546  0.528282
3    0.432857  0.994903  0.638404  0.814692  0.176334
4    0.975439  0.395670  0.110242  0.627980  0.617755
..        ...       ...       ...       ...       ...
329  0.017893  0.795698  0.699419  0.921414  0.643540
330  0.090897  0.584191  0.874407  0.216312  0.529868
331  0.045063  0.611423  0.219544  0.669319  0.342805
332  0.976453  0.224766  0.087656  0.194315  0.074177
333  0.275267  0.402811  0.655725  0.714409  0.480700

[334 rows x 5 columns]

In [36]:
type(newdf[0])

pandas.core.series.Series

### Views in Pandas

In [37]:
newdf2 = newdf
newdf2[0][0] = 2003
newdf2

C:\Users\harsh\AppData\Local\Temp\ipykernel_30328\3654261728.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 2003

            0         1         2         3         4
0        2003  0.574815  0.538166  0.116689  0.699887
1    0.080403  0.242076  0.643896  0.412260  0.790391
2    0.483287  0.878785  0.578462  0.099546  0.528282
3    0.432857  0.994903  0.638404  0.814692  0.176334
4    0.975439  0.395670  0.110242  0.627980  0.617755
..        ...       ...       ...       ...       ...
329  0.017893  0.795698  0.699419  0.921414  0.643540
330  0.090897  0.584191  0.874407  0.216312  0.529868
331  0.045063  0.611423  0.219544  0.669319  0.342805
332  0.976453  0.224766  0.087656  0.194315  0.074177
333  0.275267  0.402811  0.655725  0.714409  0.480700

[334 rows x 5 columns]

In [38]:
newdf2 = newdf.copy()
# now a copy is created

In [41]:
newdf.loc[0,0] = 2005
newdf.head(2)

          0         1         2         3         4
0      2005  0.574815  0.538166  0.116689  0.699887
1  0.080403  0.242076  0.643896  0.412260  0.790391

In [42]:
newdf.columns = list("ABCDE")
newdf.head(2)

          A         B         C         D         E
0      2005  0.574815  0.538166  0.116689  0.699887
1  0.080403  0.242076  0.643896  0.412260  0.790391

In [44]:
newdf.loc[0,'A'] = '2013'
newdf.head(2)

          A         B         C         D         E
0      2013  0.574815  0.538166  0.116689  0.699887
1  0.080403  0.242076  0.643896  0.412260  0.790391

### Removing DATA in pandas

df.drop(0, asix =1) # column

df.drop(0, asix =0) # row

In [45]:
newdf.loc[[1,2], ['C','D']]

          C         D
1  0.643896  0.412260
2  0.578462  0.099546

In [46]:
newdf.loc[:, ['C','D']] # Saari rows
newdf.loc[[1,2], :] # Saari column

          A         B         C         D         E
1  0.080403  0.242076  0.643896  0.412260  0.790391
2  0.483287  0.878785  0.578462  0.099546  0.528282

#### Queries
DataFrame.loc[Query]

In [ ]:
# Accoding to CWH video but it doesn't work
newdf.loc[(newdf['A']<0.3)]

In [53]:
newdf['A'] = pd.to_numeric(newdf['A'], errors='coerce')  # Convert 'A' column to numeric, setting non-numeric values to NaN
result = newdf.loc[newdf['A'] < 0.3]
result

            A         B         C         D         E
1    0.080403  0.242076  0.643896  0.412260  0.790391
7    0.047150  0.472724  0.360511  0.771762  0.864036
8    0.214523  0.985837  0.569916  0.235033  0.482442
9    0.023785  0.553832  0.599692  0.660796  0.064887
10   0.062643  0.571742  0.715736  0.462184  0.695964
..        ...       ...       ...       ...       ...
327  0.080031  0.802006  0.216102  0.640909  0.379764
329  0.017893  0.795698  0.699419  0.921414  0.643540
330  0.090897  0.584191  0.874407  0.216312  0.529868
331  0.045063  0.611423  0.219544  0.669319  0.342805
333  0.275267  0.402811  0.655725  0.714409  0.480700

[109 rows x 5 columns]

In [54]:
newdf.head(2)

             A         B         C         D         E
0  2013.000000  0.574815  0.538166  0.116689  0.699887
1     0.080403  0.242076  0.643896  0.412260  0.790391

In [55]:
newdf.iloc[0,4]

0.6998871928862739

In [57]:
#iloc me numbers se kaam ho jaega
newdf.iloc[[1,2],[2,3]]
#Loc me row or column ke naam dene padenge

          C         D
1  0.643896  0.412260
2  0.578462  0.099546

In [58]:
newdf.drop(['A','B'], axis=1 , inplace=True)
#inplace will make the change to original data

            C         D         E
0    0.538166  0.116689  0.699887
1    0.643896  0.412260  0.790391
2    0.578462  0.099546  0.528282
3    0.638404  0.814692  0.176334
4    0.110242  0.627980  0.617755
..        ...       ...       ...
329  0.699419  0.921414  0.643540
330  0.874407  0.216312  0.529868
331  0.219544  0.669319  0.342805
332  0.087656  0.194315  0.074177
333  0.655725  0.714409  0.480700

[334 rows x 3 columns]

In [ ]:
newdf.reset_index() #Resets the index
newdf.reset_index(drop = true) #Resets the index and ddrops previos index
newdf.reset_index(drop = true, inplace= true) #Resets the index and ddrops previos index also change the original data

In [59]:
newdf['B'].isnull()  #finds whiich index values holds the null valuuue

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

In [60]:
df = pd.DataFrame({"name": ['divyat','arshita','arin'],
"toy": [np.nan,'Batmobile','bullwhip'],
"Born":[pd.NaT, pd.Timestamp("2005,06,03"),pd.NaT]})

In [61]:
df

      name        toy       Born
0   divyat        NaN        NaT
1  arshita  Batmobile 2005-03-01
2     arin   bullwhip        NaT

In [63]:
df.dropna()
df.dropna(how='all') #removes if all field null

      name        toy       Born
1  arshita  Batmobile 2005-03-01

In [ ]:
df.drop_duplicates(subset=['Column/row name'],keep="first|last|false")

In [ ]:
df.shape()
df.info()

In [ ]:
#counting unique
df['name'].value_counts(dropna=False)
#seting false count NA 
#seting true skips  NA

In [ ]:
df.isnull()
df.notnull()